# ForgeTypeId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ForgeTypeId Class
Members See Also
---
This class holds a string that uniquely identifies a Forge schema.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class ForgeTypeId : IDisposable
```

Visual Basic
---
```text
Public Class ForgeTypeId _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ForgeTypeId : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ForgeTypeId
# See Also
ForgeTypeId Members
Autodesk.Revit.DB Namespace